#+BRAIN_PARENTS: 778cee38-4331-4a0b-93de-a1e1b6b86c7d

#+TITLE: Project Euler
#+PROPERTY: header-args :session *scheme-euler* :noweb yes :mkdirp yes
https://projecteuler.net/

** 1. Multiples of 3 or 5
:PROPERTIES:
:CREATED:  [2023-04-08 Sat 14:18]
:ID:       699ed3ab-6755-4bc4-b0e8-dde0e14b1a1d
:END:

#+begin_calc
If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9. The sum of these multiples is 23.

Find the sum of all the multiples of 3 or 5 below 1000.
#+end_calc

This can be formalized as:

($\N$)

#+begin_src scheme :tangle 1.multiples-of-3-or-5.scm :results silent
(define (sum-naturals-below multiples threshold)
  "Find the sum of the natural numbers given by MULTIPLES below THRESHOLD."
  '())
#+end_src

#+begin_src scheme
(modulo 3 10)
#+end_src

#+RESULTS:
: 3

#+begin_src scheme :noweb-ref tests :results output
(test-begin "sum-naturals")

(test-equal 23 (sum-naturals-below [3 5] 10))

(test-end "sum-naturals")
#+end_src

#+RESULTS:
: %%%% Starting test sum-naturals  (Writing full log to "sum-naturals.log")
: :69: FAIL
: # of unexpected failures  1

